from typing import Dict, List

# key星球编号 value星球名称
BALL_NAME: Dict[int, str] = {
    1: "空间站",
    2: "雅利洛",
    3: "仙舟",
}
# key为星球编号 value为该星球中所有含有怪物的区域名
AREA_NAME: Dict[int, List[str]] = {
    1: ["主控舱段", "基座舱段", "收容舱段", "支援舱段"],
    2: ["城郊雪原", "边缘通路", "铁卫禁区", "残响回廊", "永冬岭", "大矿区", "铆钉镇", "机械聚落"],
    3: ["流云渡", "迴星港", "太卜司", "工造司", "丹鼎司", "鳞渊境"],
}
# key为地区名 value是该地区传送点个数
# 例如 {"城郊雪原": 2} 意思是有 1-1 和 1-2 如果加上前面的星球就是 1-1-1 ~ 1-1-2
#                    第一个1是地区编号(在下标0处)
#                    第二个1是传送点1
AREA_POINT: Dict[str, int] = {
    "主控舱段": 1,
    "城郊雪原": 2,
}
# 有些地区需要滚动鼠标滚轮才能查找的得到，一次滚动差不多一格半间隔
AREA_SCROLL: Dict[str, int] = {
    "大矿区": 1,
    "铆钉镇": 1,
    "机械聚落": 2,
    "鳞渊境": 1,
}
